# ApplicationEntryPoint Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
ApplicationEntryPoint Constructor
ApplicationEntryPoint Class See Also
---
Initializes a new instance of the ApplicationEntryPoint class
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ApplicationEntryPoint()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ApplicationEntryPoint()
```

# See Also
ApplicationEntryPoint Class
Autodesk.Revit.DB.Macros Namespace